# 2次元リスト　－　リストの要素にリスト

# リストおさらい
x = 100
a = [1, 2, 3, "四", x]
# リストの要素には数値も文字列も変数も入れられる
print(a)
print(a[3])
# [1, 2, 3, '四', 100]
# 四

list1 = [1, 2, 3]
# リストの要素にリストは？
list2 = [list1, 2, 3]
print(list2)
# [[1, 2, 3], 2, 3]
# 出来た！リストの中にリスト。
print(list2[0])
# [1, 2, 3]
# リストの要素を取り出したらリストが出てきた。
# 二重のリスト（二次元リスト）

# リストのリストの要素を取り出したい時は[]を2つ
list2[0][2] = 99
print(list2)
# [[1, 2, 99], 2, 3]


# 九九を2次元リストで書いてみよう
# 1の段から9の段までのリストを用意
ichi  = [1, 2, 3, 4, 5, 6, 7, 8, 9]
ni    = [2, 4, 6, 8, 10, 12, 14, 16, 18]
san   = [3, 6, 9, 12, 15, 18, 21, 24, 27]
yon   = [4, 8, 12, 16, 20, 24, 28, 32, 36]
go    = [5, 10, 15, 20, 25, 30, 35, 40, 45]
roku  = [6, 12, 18, 24, 30, 36, 42, 48, 54]
sichi = [7, 14, 21, 28, 35, 42, 49, 56, 63]
hachi = [8, 16, 24, 32, 40, 48, 56, 64, 72]
ku    = [9, 18, 27, 36, 45, 54, 63, 72, 81]

# 九九のリストの中にリストを
kuku = [ichi, ni, san, yon, go, roku, sichi, hachi, ku]
print(kuku)
# [[1, 2, 3, 4, 5, 6, 7, 8, 9],
#  [2, 4, 6, 8, 10, 12, 14, 16, 18],
#  [3, 6, 9, 12, 15, 18, 21, 24, 27],
#  [4, 8, 12, 16, 20, 24, 28, 32, 36],
#  [5, 10, 15, 20, 25, 30, 35, 40, 45],
#  [6, 12, 18, 24, 30, 36, 42, 48, 54],
#  [7, 14, 21, 28, 35, 42, 49, 56, 63],
#  [8, 16, 24, 32, 40, 48, 56, 64, 72],
#  [9, 18, 27, 36, 45, 54, 63, 72, 81]]
# 一行だけど長いので改行して表示

# 表形式で九九を表示
# 細かい整形はなし。
for row in kuku:
    for value in row:
        print(value, end=" ")
    print()
# 1 2 3 4 5 6 7 8 9 
# 2 4 6 8 10 12 14 16 18 
# 3 6 9 12 15 18 21 24 27 
# 4 8 12 16 20 24 28 32 36 
# 5 10 15 20 25 30 35 40 45 
# 6 12 18 24 30 36 42 48 54 
# 7 14 21 28 35 42 49 56 63 
# 8 16 24 32 40 48 56 64 72 
# 9 18 27 36 45 54 63 72 81 

# 九九の2次元リストの別の書き方
kuku2 = []
for i in range(1, 10):
    k = []
    for j in range(1, 10):
        k.append(i * j)
    kuku2.append(k)
# print(kuku2)

# 同じことを下記の一行で書けるのがリスト内包表記
kuku3 = [[i * j for j in range(1, 10)] for i in range(1, 10)]
# print(kuku3)

# リスト内包表記まとめ
list3 = [i for i in range(1, 6)]
print(list3)
# [1, 2, 3, 4, 5]

list4 = [i * 2 for i in range(1, 6)]
print(list4)
# [2, 4, 6, 8, 10]
